CHAR_VECTOR = 'அ ஆ ஆ இ ஈ ஈ உ ஊ ஊ எ ஏ ஐ ஒ ஓ ஔ ஃ  க ங ச ஞ ட ண த ந ப ம ய ர ல வ ழ ள ற ன ஸ ஷ ஜ ஹ க்ஷ கி ஙி சி ஞி டி ணி தி நி பி மி யி ரி லி வி ழி ளி றி னி ஸி ஷி ஜி ஹி க்ஷி கீ ஙீ சீ ஞீ டீ ணீ தீ நீ பீ மீ யீ ரீ லீ வீ ழீ ளீ றீ னீ ஸீ ஷீ ஜீ ஹீ க்ஷீ கு ஙு சு ஞு டு ணு து நு பு மு யு ரு லு வு ழு ளு று னு கூ ஙூ சூ ஞூ டூ ணூ தூ நூ பூ மூ யூ ரூ லூ வூ ழூ ளூ றூ னூ ஸ்ரீ ஸு ஷு ஜு ஹு க்ஷு ஸூ ஷூ ஜூ ஹூ க்ஷூ க் ங் ச் ஞ் ட் ண் த் ந் ப் ம் ய் ர் ல் வ் ழ் ள் ற் ன் ஸ் ஷ் ஜ் ஹ் க்ஷ் '.split()

letters = [letter for letter in CHAR_VECTOR]

num_classes = len(letters) + 1

img_w, img_h = 28, 28

# Network parameters
batch_size = 128
val_batch_size = 16

downsample_factor = 4
max_text_len = 9
